tutorials/Aerodynamics/NREL6/run/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (7 0 0);

boundaryField
{
    blade
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    "(inlet|outlet|sides)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

}


// ************************************************************************* //
